; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 843974 1 1 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet8 spectrograph1)
	(have_image Star9 spectrograph0)
	(have_image Star10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph0)
	(have_image Phenomenon13 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
6. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 1 of 7
7. (turn_to satellite0 star4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star4)
   goals met: 2 of 7
8. (turn_to satellite0 star10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star10)
   goals met: 1 of 7
9. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 2 of 7
10. (turn_to satellite0 star4 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star4)
   goals met: 3 of 7
11. (turn_to satellite0 planet8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet8)
   goals met: 2 of 7
12. (take_image satellite0 planet8 instrument0 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 3 of 7
13. (turn_to satellite0 star4 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star4)
   goals met: 4 of 7
14. (turn_to satellite0 planet11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet11)
   goals met: 3 of 7
15. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 4 of 7
16. (turn_to satellite0 star4 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star4)
   goals met: 5 of 7
17. (turn_to satellite0 phenomenon13 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 7
18. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 5 of 7
19. (turn_to satellite0 star4 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star4)
   goals met: 6 of 7
20. (turn_to satellite0 phenomenon12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 7
21. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 6 of 7
22. (turn_to satellite0 star4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star4)
   goals met: 7 of 7
